<a href="https://colab.research.google.com/github/pathansayama/LetsUpgrade-DataScience-SayamaPathan-Batch1/blob/main/Assignment4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Assignment 4**

1.

In [1]:
import pandas as pd

print(pd.__version__)

1.1.4

2.

In [2]:
import pandas as pd 
import numpy as np 

a = np.array(['S','A','Y','A','M','A']) 
s = pd.Series(a) 
print(s)

0    S
1    A
2    Y
3    A
4    M
5    A
dtype: object

3.

In [5]:
import pandas as pd 
df = pd.DataFrame({'Roll Number': ['01', '02', '03', '04'], 
                   'Name': ['Alisha', 'Sam', 'Naziya', 'Zareen'], 
                   'Percentage': [90, 96, 94, 94], 
                   'Grade': ['A', 'A+', 'A', 'A'], 
                   'Subjects': ['ALL', 'ALL', 'ALL', 'ALL']}) 

df

  Roll Number    Name  Percentage Grade Subjects
0          01  Alisha          90     A      ALL
1          02     Sam          96    A+      ALL
2          03  Naziya          94     A      ALL
3          04  Zareen          94     A      ALL

4.

In [8]:
import seaborn as sb
df = sb.load_dataset('mpg')
print(df.head())

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

5.

In [9]:

import seaborn as sns
import pandas as pd

mpg=sns.load_dataset('mpg')

df = pd.DataFrame(mpg)
df[df['origin'].str.contains("usa")]

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]